#### Import the ibm_db Python library

In [1]:
import ibm_db

#### Identify the database connection credentials

In [2]:
# The code was removed by Watson Studio for sharing.

#### Create the database connection

In [ ]:
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};"
    "SECURITY={7};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd,dsn_security)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

#### Query data in a table in the database

In [4]:
#Construct the query that retrieves all rows from the EMPLOYEES table
selectQuery = "select * from EMPLOYEES"

#Execute the statement
selectStmt = ibm_db.exec_immediate(conn, selectQuery)

#Fetch the Dictionary (for the first row only)
ibm_db.fetch_both(selectStmt)

{'EMP_ID': 'E1001    ',
 0: 'E1001    ',
 'F_NAME': 'John',
 1: 'John',
 'L_NAME': 'Thomas',
 2: 'Thomas',
 'SSN': '123456   ',
 3: '123456   ',
 'B_DATE': datetime.date(1976, 1, 9),
 4: datetime.date(1976, 1, 9),
 'SEX': 'M',
 5: 'M',
 'ADDRESS': '5631 Rice, OakPark,IL',
 6: '5631 Rice, OakPark,IL',
 'JOB_ID': '100      ',
 7: '100      ',
 'SALARY': '100000.00',
 8: '100000.00',
 'MANAGER_ID': '30001    ',
 9: '30001    ',
 'DEP_ID': '2        ',
 10: '2        '}

In [5]:
#Fetch the rest of the rows and print the EMP_ID and F_NAME for those rows
while ibm_db.fetch_row(selectStmt) != False:
   print ("EMP_ID:",  ibm_db.result(selectStmt, 0), " F_NAME:",  ibm_db.result(selectStmt, "F_NAME"))

EMP_ID: E1002      F_NAME: Alice
EMP_ID: E1003      F_NAME: Steve
EMP_ID: E1004      F_NAME: Santosh
EMP_ID: E1005      F_NAME: Ahmed
EMP_ID: E1006      F_NAME: Nancy
EMP_ID: E1007      F_NAME: Mary
EMP_ID: E1008      F_NAME: Bharath
EMP_ID: E1009      F_NAME: Andrea
EMP_ID: E1010      F_NAME: Ann

####  Retrieve data into Pandas

In [6]:
import pandas
import ibm_db_dbi

In [7]:
#connection for pandas
pconn = ibm_db_dbi.Connection(conn)

In [10]:
#query statement to retrieve all rows in EMPLOYEES table
selectQuery = "select * from EMPLOYEES"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery, pconn)

#print the data in the pandas data frame
pdf

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000.0,30003,7
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000.0,30004,5

In [11]:
pdf.shape

(10, 11)

In [18]:
pdf.loc[1:4]

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2

In [17]:
pdf.loc[0:3]

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5

In [24]:
ibm_db.close(conn)

True